#### 산술연산
- 시리즈 연산

In [2]:
import pandas as pd

# 시리즈 vs 숫자
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
print(student1)

percentage = student1/100
print(percentage,"\n\n")
print(type(percentage))

국어    100
영어     80
수학     90
dtype: int64
국어    1.0
영어    0.8
수학    0.9
dtype: float64


<class 'pandas.core.series.Series'>

In [7]:
# 시리즈 vs 시리즈
student2 = pd.Series({'수학': 80, '국어': 90, '영어':80})
print(student1,"\n\n",student2)

add = student1 + student2
subt = student1 - student2
multi = student1 * student2
divi = student1 / student2
print(type(divi),"\n\n")

result = pd.DataFrame([add, subt, multi, divi], index=(['덧셈','뺄셈','곱셈','나눗셈']))
display(result)

국어    100
영어     80
수학     90
dtype: int64

 수학    80
국어    90
영어    80
dtype: int64
<class 'pandas.core.series.Series'>

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

인덱스를 보고 연산을 진행하지만, 원소 개수가 다르거나 인덱스 값이 다르다면 연산을 처리할 수 없어 NaN값이 출력된다.

In [8]:
# NaN 값이 있는 시리즈 연산
import numpy as np

student1 = pd.Series({'국어': np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90})

display(student1)
display(student2)

add = student1 + student2
subt = student1 - student2
multi = student1 * student2
divi = student1 / student2

result = pd.DataFrame([add, subt, multi, divi], index=(['덧셈','뺄셈','곱셈','나눗셈']))
display(result)

국어     NaN
영어    80.0
수학    90.0
dtype: float64

수학    80
국어    90
dtype: int64

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [9]:
# 연산 메소드
# NaN이 포함 될경우 반환값을 0으로 지정

sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index=(['덧셈','뺄셈','곱셈','나눗셈']))
display(result)

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

- 데이터프레임 연산

In [14]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
display(df.head())
print(df.dtypes)

addition = df + 10
display(addition.head())
print(addition.dtypes)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

age     float64
fare    float64
dtype: object

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

age     float64
fare    float64
dtype: object

In [18]:
# 데이터프레임끼리 더하기
sub = addition - df
display(sub.head(3))
print(sub.dtypes)

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0

age     float64
fare    float64
dtype: object